# Вывести на экран числа от -N до N
print("введите N")
N = int(input())
for i in range(-N, N+1):
    print(i)